Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Boolean)
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to match all elements which are of the given categories.
categoryIds:
The category ids to match.
inverted:
True if the filter should match all elements which are not of the given categories.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more categories was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012